# Built In Failures Analytical Automation Failures Empty Selection Property

Source: https://www.revitapidocs.com/2026/c394bad7-6235-d85b-5b54-bff496f8c68a.htm

---

| Built In Failures Analytical Automation Failures Empty Selection Property |
| --- |

There are no selected elements.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId EmptySelection { get; }
```

```
Public Shared ReadOnly Property EmptySelection As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ EmptySelection {
	FailureDefinitionId^ get ();
}
```

```
static member EmptySelection : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures AnalyticalAutomationFailures Class Autodesk.Revit.DB Namespace